# Pandas Input and Output

* CSV 
* Excel
* HTML
* SQL

In [1]:
import pandas as pd

In [2]:
pwd

'/Users/actify/repos_faraz/python4ds'

In [3]:
pd.read_csv("./03-Python-for-Data-Analysis-Pandas/example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df = pd.read_csv("03-Python-for-Data-Analysis-Pandas/example")

In [5]:
df.to_csv('my_output', index=False)

In [6]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
import xlrd as xl

ModuleNotFoundError: No module named 'xlrd'

In [8]:
x = pd.read_excel("/Users/actify/Downloads/clean_customers.xlsx", )

ImportError: Missing optional dependency 'xlrd'. Install xlrd >= 1.0.0 for Excel support Use pip or conda to install xlrd.

In [9]:
x.columns

NameError: name 'x' is not defined

In [10]:
x = x[['customerid_text', 'customerid', 'customername', 'email', 'mobile',
       'communicationmode', 'recency', 'freq', 'sales', 'Validation of Tag',
       'CustomeTagVlookup', 'Custome Tag Final', 'Name 1 ', 'Name 2', 'Name 3']]

NameError: name 'x' is not defined

In [11]:
x.head(10)

NameError: name 'x' is not defined

In [12]:
x.groupby('communicationmode')['recency'].sum()

NameError: name 'x' is not defined

In [13]:
import numpy as np
d = {'X' : ['a', 'b', 'c', 'a', 'a'], 
     'Y' : [5,2,6,2, np.nan], 
     'Z' : [np.nan,6,9,1, 10]}
df = pd.DataFrame(d)
df

   X    Y     Z
0  a  5.0   NaN
1  b  2.0   6.0
2  c  6.0   9.0
3  a  2.0   1.0
4  a  NaN  10.0

In [14]:
df.groupby('X')[['Y']].sum()

     Y
X
a  7.0
b  2.0
c  6.0

In [15]:
# import lxml
import pandas as pd
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [23]:
df = data[0]

In [24]:
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
...,...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [25]:
from sqlalchemy import create_engine

In [26]:
engine = create_engine('sqlite:///:memory:')

In [28]:
df.to_sql('my_table', engine)

In [29]:
query = "select * from my_table"

In [30]:
sqldf = pd.read_sql('my_table', con = engine)

In [31]:
sqldf

,index,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
...,...,...,...,...,...,...,...,...
554,554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
555,555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
556,556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
557,557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
558,558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"